export const problem = {
  첫번째: ["정답", "1", "2", "3"],
  두번째: ["정답", "1", "2", "3"],
  세번째: ["정답", "1", "2", "3"],
  네번째: ["정답", "1", "2", "3"],
  다섯번째: ["정답", "1", "2", "3"],
  여섯번째: ["정답", "1", "2", "3"],
  일곱번째: ["정답", "1", "2", "3"],
  여덟번째: ["정답", "1", "2", "3"],
  아홉번째: ["정답", "1", "2", "3"],
  열번째: ["정답", "1", "2", "3"],
  열한번째: ["정답", "1", "2", "3"],
};

export const warningMessage: Array<String> = [
  "2023년 11월 01일 레볼루션 하트 막내 류님의 생일을 맞아, 류님과 관련한 문제들로 모의고사를 준비하였습니다.",
  "문제는 총 11개의 객관식 문제들로 구성되어 있습니다.",
  "모든 문제는 류님의 나무위키, 생방송, 유튜브 를 기반으로 출제하였습니다.",
  "만약 문제의 정답이 틀렸다고 판단되는 경우, 증빙과 함께 연락주시면 확인 후 반영드리도록 하겠습니다.",
  "류님 본인인 경우, 증빙 필요 없습니다🤗",
  "재미로 즐겨주세요!",
];

export const number = [2, 0, 0, 2, "-", 1, 1, 0, 1];
