interface problems {
  number: String;
  problem: String;
  ex: Array<String>;
}

export const problems: Array<problems> = [
  {
    number: "첫번째",
    problem: "아카이로 류님의 생일은? (이건 맞춰야겠지?)",
    ex: ["2002년 11월 01일", "2001년 11월 11일", "2002년 11월 10일", "2002년 11월 11일"],
  },
  {
    number: "두번째",
    problem: "나는 문제야2",
    ex: ["나는야 정답이야", "2", "3", "4"],
  },
  {
    number: "세번째",
    problem: "나는 문제야3",
    ex: ["나는야 정답이야", "2", "3", "4"],
  },
  {
    number: "네번째",
    problem: "나는 문제야4",
    ex: ["나는야 정답이야", "2", "3", "4"],
  },
  {
    number: "다섯번째",
    problem: "나는 문제야5",
    ex: ["나는야 정답이야", "2", "3", "4"],
  },
  {
    number: "여섯번째",
    problem: "나는 문제야6",
    ex: ["나는야 정답이야", "2", "3", "4"],
  },
  {
    number: "일곱번째",
    problem: "나는 문제야7",
    ex: ["나는야 정답이야", "2", "3", "4"],
  },
  {
    number: "여덟번째",
    problem: "나는 문제야8",
    ex: ["나는야 정답이야", "2", "3", "4"],
  },
  {
    number: "아홉번째",
    problem: "나는 문제야9",
    ex: ["나는야 정답이야", "2", "3", "4"],
  },
  { number: "열번째", problem: "나는 문제야10", ex: ["나는야 정답이야", "2", "3", "4"] },
  {
    number: "열한번째",
    problem: "나는 문제야11",
    ex: ["나는야 정답이야", "2", "3", "4"],
  },
];

export const warningMessage: Array<String> = [
  "2023년 11월 01일 레볼루션 하트 막내 류님의 생일을 맞아, 류님과 관련한 문제들로 모의고사를 준비하였습니다.",
  "문제는 총 11개의 객관식 문제들로 구성되어 있습니다.",
  "모든 문제는 류님의 나무위키, 생방송, 유튜브 를 기반으로 출제하였습니다.",
  "만약 문제의 정답이 틀렸다고 판단되는 경우, 증빙과 함께 연락주시면 확인 후 반영드리도록 하겠습니다.",
  "류님 본인인 경우, 증빙 필요 없습니다🤗",
  "재미로 즐겨주세요!",
];

export const number = [2, 0, 0, 2, "-", 1, 1, 0, 1];
